MinhazRaufoon/ASE-Praktikum-Units/Unit 3/SPC56ELxx_RLA CAN Test Application for DiscoveryPlus/components/spc56elxx_low_level_drivers_component_rla/lib/include/spi_lld.h
#if (SPC5_SPI_USE_DSPI0 == TRUE) && (SPC5_HAS_DSPI0 == FALSE)
#error "DSPI0 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI1 == TRUE) && (SPC5_HAS_DSPI1 == FALSE)
#error "DSPI1 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI2 == TRUE) && (SPC5_HAS_DSPI2 == FALSE)
#error "DSPI2 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI3 == TRUE) && (SPC5_HAS_DSPI3 == FALSE)
#error "DSPI3 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI4 == TRUE) && (SPC5_HAS_DSPI4 == FALSE)
#error "DSPI4 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI5 == TRUE) && (SPC5_HAS_DSPI5 == FALSE)
#error "DSPI5 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI6 == TRUE) && (SPC5_HAS_DSPI6 == FALSE)
#error "DSPI6 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI7 == TRUE) && (SPC5_HAS_DSPI7 == FALSE)
#error "DSPI7 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI8 == TRUE) && (SPC5_HAS_DSPI8 == FALSE)
#error "DSPI8 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI9 == TRUE) && (SPC5_HAS_DSPI9 == FALSE)
#error "DSPI9 not present in the selected device"
#endif

#if (SPC5_SPI_USE_DSPI0 == FALSE) && (SPC5_SPI_USE_DSPI1 == FALSE) &&       \
    (SPC5_SPI_USE_DSPI2 == FALSE) && (SPC5_SPI_USE_DSPI3 == FALSE) &&       \
    (SPC5_SPI_USE_DSPI4 == FALSE) && (SPC5_SPI_USE_DSPI5 == FALSE) &&       \
    (SPC5_SPI_USE_DSPI6 == FALSE) && (SPC5_SPI_USE_DSPI7 == FALSE) &&       \
    (SPC5_SPI_USE_DSPI8 == FALSE) && (SPC5_SPI_USE_DSPI9 == FALSE)
#error "SPI driver activated but no DSPI peripheral assigned"
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI0 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI0_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI0_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI0_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI0_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI0"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI1 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI1_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI1_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI1_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI1_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI1"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI2 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI2_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI2_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI2_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI2_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI2"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI3 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI3_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI3_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI3_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI3_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI3"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI4 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI4_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI4_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI4_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI4_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI4"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI5 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI5_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI5_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI5_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI5_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI5"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI6 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI6_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI6_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI6_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI6_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI6"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI7 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI7_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI7_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI7_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI7_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI7"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI8 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI8_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI8_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI8_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI8_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI8"
#endif
#endif

#if (SPC5_HAS_EDMA == TRUE) && (SPC5_SPI_USE_DSPI9 == TRUE)
#if ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_ONLY) &&                         \
     (!defined(SPC5_SPI_DSPI9_RX_DMA_CH_ID))) ||                            \
    ((SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) &&                       \
     (!defined(SPC5_SPI_DSPI9_TX1_DMA_CH_ID) ||                             \
      !defined(SPC5_SPI_DSPI9_TX2_DMA_CH_ID) ||                             \
	  !defined(SPC5_SPI_DSPI9_RX_DMA_CH_ID)))
#error "DMA channels not defined for DSPI9"
#endif
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a structure representing an SPI driver.
 */
typedef struct SPIDriver SPIDriver;

/**
 * @brief   SPI notification callback type.
 *
 * @param[in] spip      pointer to the @p SPIDriver object triggering the
 *                      callback
 */
typedef void (*spicallback_t)(SPIDriver *spip);

/**
 * @brief   Driver configuration structure.
 * @note    Implementations may extend this structure to contain more,
 *          architecture dependent, fields.
 */
typedef struct {
  /**
   * @brief   Operation complete callback.
   */
  spicallback_t         end_cb;
  /* End of the mandatory fields.*/
  /**
   * @brief   The chip select line port.
   */
  ioportid_t            ssport;
  /**
   * @brief   The chip select line pad number.
   */
  uint16_t              sspad;
  /**
   * @brief   DSPI CTAR0 value for this session.
   */
  uint32_t              ctar0;
  /**
   * @brief   DSPI PUSHR command for this session.
   * @note    Only CTAR0 can be referenced, the other CTARs are not
   *          initialized. The data part must be left to zero.
   */
  uint32_t              pushr;
} SPIConfig;

/**
 * @brief   Structure representing an SPI driver.
 * @note    Implementations may extend this structure to contain more,
 *          architecture dependent, fields.
 */
struct SPIDriver {
  /**
   * @brief   Current configuration data.
   */
  const SPIConfig           *config;
  /**
   * @brief   Waiting flag.
   */
  volatile uint8_t           ready;
  /**
   * @brief   Pointer to the DSPI registers block.
   */
  struct spc5_dspi          *dspi;
#if (SPC5_SPI_DMA_MODE != SPC5_SPI_DMA_NONE) || defined(__DOXYGEN__)
  /**
   * @brief   EDMA channel used for receive.
   */
  edma_channel_t            rx_channel;
#else /* SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_NONE */
  /**
   * @brief   Memory pointer for RX operations.
   */
  union {
    void                    *rx_ptr;
    uint8_t                 *rx_ptr8;
    uint16_t                *rx_ptr16;
  };
  /**
   * @brief   Remaining frames to be received.
   */
  size_t                    rx_cnt;
#endif /* SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_NONE */
#if (SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_RX_AND_TX) || defined(__DOXYGEN__)
  /**
   * @brief   EDMA channel used for data memory to memory copy.
   */
  edma_channel_t            tx1_channel;
  /**
   * @brief   EDMA channel used for transmit.
   */
  edma_channel_t            tx2_channel;
  /**
   * @brief   Command for the ongoing TX operation.
   */
  uint32_t                  tx_cmd;
  /**
   * @brief   Last frame of a transmission sequence.
   */
  uint32_t                  tx_last;
#else /* SPC5_SPI_DMA_MODE != SPC5_SPI_DMA_RX_AND_TX */
  /**
   * @brief   Memory pointer for TX operations.
   */
  union {
    const void              *tx_ptr;
    const uint8_t           *tx_ptr8;
    const uint16_t          *tx_ptr16;
  };
  /**
   * @brief   Remaining frames to be transmitted.
   */
  size_t                    tx_cnt;
#endif /* SPC5_SPI_DMA_MODE != SPC5_SPI_DMA_RX_AND_TX */
};

/*===========================================================================*/
/* IRQ Handlers                                                              */
/*===========================================================================*/

#if (SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_NONE) || defined(__DOXYGEN__)
#if (SPC5_SPI_USE_DSPI0 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI0_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI0_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI0_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI0 */
#if (SPC5_SPI_USE_DSPI1 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI1_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI1_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI1_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI1 */
#if (SPC5_SPI_USE_DSPI2 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI2_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI2_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI2_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI2 */
#if (SPC5_SPI_USE_DSPI3 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI3_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI3_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI3_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI3 */
#if (SPC5_SPI_USE_DSPI4 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI4_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI4_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI4_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI4 */
#if (SPC5_SPI_USE_DSPI5 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI5_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI5_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI5_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI5 */
#if (SPC5_SPI_USE_DSPI6 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI6_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI6_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI6_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI6 */
#if (SPC5_SPI_USE_DSPI7 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI7_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI7_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI7_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI7 */
#if (SPC5_SPI_USE_DSPI8 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI8_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI8_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI8_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI8 */
#if (SPC5_SPI_USE_DSPI9 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI9_RFDF_HANDLER);
IRQ_HANDLER(SPC5_DSPI9_EOQF_HANDLER);
IRQ_HANDLER(SPC5_DSPI9_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI9 */
#endif /* SPC5_SPI_DMA_MODE == SPC5_SPI_DMA_NONE */

#if (SPC5_SPI_DMA_MODE != SPC5_SPI_DMA_NONE) || defined(__DOXYGEN__)
#if (SPC5_SPI_USE_DSPI0 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI0_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI0 */
#if (SPC5_SPI_USE_DSPI1 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI1_TFFF_HANDLER) ;
#endif /* SPC5_SPI_USE_DSPI1 */
#if (SPC5_SPI_USE_DSPI2 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI2_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI2 */
#if (SPC5_SPI_USE_DSPI3 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI3_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI3 */
#if (SPC5_SPI_USE_DSPI4 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI4_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI4 */
#if (SPC5_SPI_USE_DSPI5 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI5_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI5 */
#if (SPC5_SPI_USE_DSPI6 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI6_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI6 */
#if (SPC5_SPI_USE_DSPI7 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI7_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI7 */
#if (SPC5_SPI_USE_DSPI8 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI8_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI8 */
#if (SPC5_SPI_USE_DSPI9 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_DSPI9_TFFF_HANDLER);
#endif /* SPC5_SPI_USE_DSPI9 */
#endif /* SPC5_SPI_DMA_MODE != SPC5_SPI_DMA_NONE */

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

