MinhazRaufoon/ASE-Praktikum-Units/Unit 3/SPC56ELxx_RLA CAN Test Application for DiscoveryPlus/components/spc56elxx_low_level_drivers_component_rla/lib/include/spi_lld.h
#if (SPC5_SPI_USE_DSPI0 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID1;
#endif

#if (SPC5_SPI_USE_DSPI1 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID2;
#endif

#if (SPC5_SPI_USE_DSPI2 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID3;
#endif

#if (SPC5_SPI_USE_DSPI3 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID4;
#endif

#if (SPC5_SPI_USE_DSPI4 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID5;
#endif

#if (SPC5_SPI_USE_DSPI5 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID6;
#endif

#if (SPC5_SPI_USE_DSPI6 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID7;
#endif

#if (SPC5_SPI_USE_DSPI7 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID8;
#endif

#if (SPC5_SPI_USE_DSPI8 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID9;
#endif

#if (SPC5_SPI_USE_DSPI9 == TRUE) && !defined(__DOXYGEN__)
extern SPIDriver SPID10;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void spi_lld_init(void);
  void spi_lld_start(SPIDriver *spip, const SPIConfig *config);
  void spi_lld_stop(SPIDriver *spip);
  void spi_lld_select(SPIDriver *spip);
  void spi_lld_unselect(SPIDriver *spip);
  void spi_lld_ignore(SPIDriver *spip, size_t n);
  void spi_lld_exchange(SPIDriver *spip, size_t n,
                        const void *txbuf, void *rxbuf);
  void spi_lld_send(SPIDriver *spip, size_t n, const void *txbuf);
  void spi_lld_receive(SPIDriver *spip, size_t n, void *rxbuf);
  uint16_t spi_lld_polled_exchange(SPIDriver *spip, uint16_t frame);
#ifdef __cplusplus
}
#endif

#endif /* LLD_USE_SPI */

#endif /* _SPI_LLD_H_ */

/** @} */
